## Ejercicio 2
### Pandas

+ Manipulación de dataframes
+ Limpieza de datos (funciones lambda)
+ Conclusiones sobre los datos (pivots)

El dataset de este ejercicio es un detalle de los atributos de todos los futbolistas incluidos en la base de datos de FIFA 19. Tenemos variables como nacionalidad, peso, altura, tambien variables de rendimiento como calificacion general (overall, potential) entre otros. El dataset esta dividido en 2 bases el objetivo de este ejercicio es construir una sola base y obtener insights

### REALIZADO POR: Fernanda Castro

In [1]:
import requests, zipfile 
from urllib.request import urlopen
from io import BytesIO
import pandas as pd
import numpy as np

In [2]:
zip_file_url = 'https://github.com/vanejaime/Curso_Python_CD/raw/master/datasets/FIFA19.csv.zip'
remote_zip_file = urlopen(zip_file_url)
zipinmemory = BytesIO(remote_zip_file.read())
zip_file = zipfile.ZipFile(zipinmemory)

data1 = pd.read_csv(zip_file.open(zip_file.namelist()[0]),encoding='850') #si tienen problemas intentar encoding='utf-8' o quitar la opcion encoding
data2 = pd.read_csv(zip_file.open(zip_file.namelist()[1]),encoding='850')
dict_position = pd.read_csv(zip_file.open(zip_file.namelist()[2]),encoding='850')

In [3]:
zip_file.namelist()

['data1.csv', 'data2.csv', 'Significado_Posiciones.csv', 'Variables.csv']

In [4]:
data1.head()

,Row,ID,Name,Age,Nationality,Overall,Potential,Club,Preferred Foot,International Reputation,Weak Foot,Skill Moves,Position,Jersey Number,Joined,Loaned From,Contract Valid Until
0,0,158023,L. Messi,31,Argentina,94,94,FC Barcelona,Left,5.0,4.0,4.0,RF,10.0,1/07/2004,NaN,2021
1,1,20801,Cristiano Ronaldo,33,Portugal,94,94,Juventus,Right,5.0,4.0,5.0,ST,7.0,10/07/2018,NaN,2022
2,2,190871,Neymar Jr,26,Brazil,92,93,Paris Saint-Germain,Right,5.0,5.0,5.0,LW,10.0,3/08/2017,NaN,2022
3,3,193080,De Gea,27,Spain,91,93,Manchester United,Right,4.0,3.0,1.0,GK,1.0,1/07/2011,NaN,2020
4,4,192985,K. De Bruyne,27,Belgium,91,92,Manchester City,Right,4.0,5.0,4.0,RCM,7.0,30/08/2015,NaN,2023

In [5]:
data2.head()

,Row,ID,Height(in),Weight(lbs),Release Clause(Eur),Value(Eur),Wage(Eur)
0,0,158023,67,159.0,2.265000e+09,1105000000,565000
1,1,20801,74,183.0,1.271000e+09,77000000,405000
2,2,190871,69,150.0,2.281000e+09,1185000000,290000
3,3,193080,76,168.0,1.386000e+09,72000000,260000
4,4,192985,71,154.0,1.964000e+09,102000000,355000

In [6]:
dict_position.head()

  Position     Significado
0      CAM  Medio Campista
1       CB         Defensa
2      CDM  Medio Campista
3       CF       Delantero
4       CM  Medio Campista

### PARTE A.

1. Unir las bases data1 y data2.
2. Eliminar columnas innecesarias.
3. Establecer como indice del dataframe la columna ID (id único para cada futbolista)
4. Crear una variable "Significado" esta variable corresponde al significado que tienen las siglas de la columna Position, el significado de cada sigla lo encuentran en el dataframe dict_position
5. A los valores vacios ó en 0 de la columna Release Clause asignarles el min de dicha columna (imprimir cuantos NaN hay)
6. A los valores vacios ó en 0 de la columna Value asignarles la media de dicha columna (imprimir cuantos NaN hay)
7. A los valores vacios ó en 0 de la columna Wage asignarles el maximo de dicha columna (imprimir cuantos NaN hay)
8. Arreglar la columna Height, convertirla a cm (actualmente en in)
9. Arreglar la columna Weight, convertirla a kg (actualmente en lbs)

In [7]:
#1. Union
union = pd.merge(data1, data2, on='ID', how='inner')
union.head()

,Row_x,ID,Name,Age,Nationality,Overall,Potential,Club,Preferred Foot,International Reputation,...,Jersey Number,Joined,Loaned From,Contract Valid Until,Row_y,Height(in),Weight(lbs),Release Clause(Eur),Value(Eur),Wage(Eur)
0,0,158023,L. Messi,31,Argentina,94,94,FC Barcelona,Left,5.0,...,10.0,1/07/2004,NaN,2021,0,67,159.0,2.265000e+09,1105000000,565000
1,1,20801,Cristiano Ronaldo,33,Portugal,94,94,Juventus,Right,5.0,...,7.0,10/07/2018,NaN,2022,1,74,183.0,1.271000e+09,77000000,405000
2,2,190871,Neymar Jr,26,Brazil,92,93,Paris Saint-Germain,Right,5.0,...,10.0,3/08/2017,NaN,2022,2,69,150.0,2.281000e+09,1185000000,290000
3,3,193080,De Gea,27,Spain,91,93,Manchester United,Right,4.0,...,1.0,1/07/2011,NaN,2020,3,76,168.0,1.386000e+09,72000000,260000
4,4,192985,K. De Bruyne,27,Belgium,91,92,Manchester City,Right,4.0,...,7.0,30/08/2015,NaN,2023,4,71,154.0,1.964000e+09,102000000,355000

In [8]:
#2. Eliminar columnas innecesarias
union.drop(['Row_x','Row_y'], axis=1, inplace=True)
#3. Indice va a ser el ID del jugador
union.set_index('ID', inplace=True)
union.head()

,Name,Age,Nationality,Overall,Potential,Club,Preferred Foot,International Reputation,Weak Foot,Skill Moves,Position,Jersey Number,Joined,Loaned From,Contract Valid Until,Height(in),Weight(lbs),Release Clause(Eur),Value(Eur),Wage(Eur)
ID,,,,,,,,,,,,,,,,,,,,
158023,L. Messi,31,Argentina,94,94,FC Barcelona,Left,5.0,4.0,4.0,RF,10.0,1/07/2004,NaN,2021,67,159.0,2.265000e+09,1105000000,565000
20801,Cristiano Ronaldo,33,Portugal,94,94,Juventus,Right,5.0,4.0,5.0,ST,7.0,10/07/2018,NaN,2022,74,183.0,1.271000e+09,77000000,405000
190871,Neymar Jr,26,Brazil,92,93,Paris Saint-Germain,Right,5.0,5.0,5.0,LW,10.0,3/08/2017,NaN,2022,69,150.0,2.281000e+09,1185000000,290000
193080,De Gea,27,Spain,91,93,Manchester United,Right,4.0,3.0,1.0,GK,1.0,1/07/2011,NaN,2020,76,168.0,1.386000e+09,72000000,260000
192985,K. De Bruyne,27,Belgium,91,92,Manchester City,Right,4.0,5.0,4.0,RCM,7.0,30/08/2015,NaN,2023,71,154.0,1.964000e+09,102000000,355000

In [9]:
#4. Significado
posi = pd.DataFrame(dict_position)
posi.head()
union2 = pd.merge(union, posi, on='Position', how='left')
union2.head()

,Name,Age,Nationality,Overall,Potential,Club,Preferred Foot,International Reputation,Weak Foot,Skill Moves,...,Jersey Number,Joined,Loaned From,Contract Valid Until,Height(in),Weight(lbs),Release Clause(Eur),Value(Eur),Wage(Eur),Significado
0,L. Messi,31,Argentina,94,94,FC Barcelona,Left,5.0,4.0,4.0,...,10.0,1/07/2004,NaN,2021,67,159.0,2.265000e+09,1105000000,565000,Delantero
1,Cristiano Ronaldo,33,Portugal,94,94,Juventus,Right,5.0,4.0,5.0,...,7.0,10/07/2018,NaN,2022,74,183.0,1.271000e+09,77000000,405000,Delantero
2,Neymar Jr,26,Brazil,92,93,Paris Saint-Germain,Right,5.0,5.0,5.0,...,10.0,3/08/2017,NaN,2022,69,150.0,2.281000e+09,1185000000,290000,Lateral
3,De Gea,27,Spain,91,93,Manchester United,Right,4.0,3.0,1.0,...,1.0,1/07/2011,NaN,2020,76,168.0,1.386000e+09,72000000,260000,Portero
4,K. De Bruyne,27,Belgium,91,92,Manchester City,Right,4.0,5.0,4.0,...,7.0,30/08/2015,NaN,2023,71,154.0,1.964000e+09,102000000,355000,Medio Campista

In [10]:
#5. A los valores vacios ó en 0 de la columna Release Clause asignarles el minimo de dicha columna
print(union2['Release Clause(Eur)'].isnull().sum())
union2['Release Clause(Eur)'].fillna(union2['Release Clause(Eur)'].min())
union2['Release Clause(Eur)'].replace(0,union2['Release Clause(Eur)'].min())

1564

0        2.265000e+09
1        1.271000e+09
2        2.281000e+09
3        1.386000e+09
4        1.964000e+09
             ...
18202    1.430000e+05
18203    1.130000e+05
18204    1.650000e+05
18205    1.430000e+05
18206    1.650000e+05
Name: Release Clause(Eur), Length: 18207, dtype: float64

In [11]:
#6. A los valores vacios ó en 0 de la columna Value asignarles la media de dicha columna (imprimir cuantos NaN hay)
print(union2['Value(Eur)'].isnull().sum())
union2['Value(Eur)'].fillna(union2['Value(Eur)'].mean())
union2['Value(Eur)'].replace(0,union2['Value(Eur)'].mean())

0

0        1.105000e+09
1        7.700000e+07
2        1.185000e+09
3        7.200000e+07
4        1.020000e+08
             ...
18202    6.000000e+04
18203    6.000000e+04
18204    6.000000e+04
18205    6.000000e+04
18206    6.000000e+04
Name: Value(Eur), Length: 18207, dtype: float64

In [12]:
#7. A los valores vacios ó en 0 de la columna Wage asignarles el maximo de dicha columna (imprimir cuantos NaN hay)
print(union2['Wage(Eur)'].isnull().sum())
union2['Wage(Eur)'].fillna(union2['Wage(Eur)'].mean())
union2['Wage(Eur)'].replace(0,union2['Wage(Eur)'].mean())

0

0        565000.0
1        405000.0
2        290000.0
3        260000.0
4        355000.0
           ...
18202      1000.0
18203      1000.0
18204      1000.0
18205      1000.0
18206      1000.0
Name: Wage(Eur), Length: 18207, dtype: float64

In [13]:
#8. Arreglar la columna Height, convertirla a cm (actualmente en in)
union2['Height(cm)'] = union2['Height(in)'] * 2.54
union2.drop(['Height(in)'], axis=1, inplace=True)

In [14]:
#9. Arreglar la columna Weight, convertirla a kg (actualmente en lbs)
union2['Weight(kg)'] = union2['Weight(lbs)'] * 0.453592
union2.drop(['Weight(lbs)'], axis=1, inplace=True)

In [15]:
union2.head()

,Name,Age,Nationality,Overall,Potential,Club,Preferred Foot,International Reputation,Weak Foot,Skill Moves,...,Jersey Number,Joined,Loaned From,Contract Valid Until,Release Clause(Eur),Value(Eur),Wage(Eur),Significado,Height(cm),Weight(kg)
0,L. Messi,31,Argentina,94,94,FC Barcelona,Left,5.0,4.0,4.0,...,10.0,1/07/2004,NaN,2021,2.265000e+09,1105000000,565000,Delantero,170.18,72.121128
1,Cristiano Ronaldo,33,Portugal,94,94,Juventus,Right,5.0,4.0,5.0,...,7.0,10/07/2018,NaN,2022,1.271000e+09,77000000,405000,Delantero,187.96,83.007336
2,Neymar Jr,26,Brazil,92,93,Paris Saint-Germain,Right,5.0,5.0,5.0,...,10.0,3/08/2017,NaN,2022,2.281000e+09,1185000000,290000,Lateral,175.26,68.038800
3,De Gea,27,Spain,91,93,Manchester United,Right,4.0,3.0,1.0,...,1.0,1/07/2011,NaN,2020,1.386000e+09,72000000,260000,Portero,193.04,76.203456
4,K. De Bruyne,27,Belgium,91,92,Manchester City,Right,4.0,5.0,4.0,...,7.0,30/08/2015,NaN,2023,1.964000e+09,102000000,355000,Medio Campista,180.34,69.853168

### PARTE B.
Hint: Pivot, Counts, max, min, indexación.

Conteste las siguientes preguntas:
1. Cual es el jugador mas y menos pesado?
2. Cual es el jugador mas y menos alto?
3. Cual es el jugador mas y menos viejo?
4. AntiTop 10 de jugadores según overall
5. Cual es la distribución de jugadores por País? (Tabla)
6. Cual es la distribución de jugadores por Edad? (Tabla)
7. Cual es la distribución de jugadores por Posición (columna Significado)? (Tabla)
8. Cual es el promedio de altura, peso por país
9. Cual es el promedio de altura, peso por equipo
10. Cual es el equipo mas caro egún el salario (wage)
11. Cual es el equipo mas economico según el salario (wage)
12. Cual es la distribución de jugadores por pie preferido?
13. Cual es la relacion entre el país de origen y la posición?
14. Cual es numero de camiseta mas y menos usado?
15. Cual es el equipo que mas cede jugadores a otros equipos?
16. Cual es el equipo que menos cede jugadores a otros equipos?
17. Cual es el equipo que mas recibe jugadores de otros equipos?
18. Cual es el promedio de salario (wage) por posicion (significado)?
19. Cual es el equipo con mas valor en el mercado (Value)?
20. Cual es el equipo con menos valor en el mercado (Value)?
21. Top 7 de jugadores de clausulas de permanencia, muestre al equipo al que pertenece. (Release Clause(Eur))
22. Cual es el país con los mejores jugadores (overrall y potential) (Tabla)
23. Cual es el país con los peores jugadores (overrall y potential) (Tabla)
24. Cree que hay relación entre el Valor del jugador y el país de origen?
25. Cree que hay relación entre el Valor del jugador y la edad?
26. Haga un histograma sobre la variable Contract Valid Until, que dice este histograma?
27. Cual es el promedio de edad por posición?
28. Cual es el promedio de peso por posición?
29. Cual es el promedio de altura por posición?
30. Agregue cualquier otra conclusión que detecte en el análisis de la base anterior

In [29]:
#1
filtro1 = union2['Weight(kg)']==union2['Weight(kg)'].min()
filtro2 = union2['Weight(kg)']==union2['Weight(kg)'].max()
union2_min = union2[filtro1]
union2_max = union2[filtro2]
print('Menos Pesado:')
print(union2_min[['Name','Weight(kg)']])
print('\n')
print('Más Pesado:')
print(union2_max[['Name','Weight(kg)']])

Menos Pesado:
                Name  Weight(kg)
13338  B. Al Mutairi    49.89512
17157   K. Yamaguchi    49.89512


Más Pesado:
              Name  Weight(kg)
9501  A. Akinfenwa  110.222856

In [30]:
#2
filtro1 = union2['Height(cm)']==union2['Height(cm)'].min()
filtro2 = union2['Height(cm)']==union2['Height(cm)'].max()
union2_min = union2[filtro1]
union2_max = union2[filtro2]
print('Menos Alto:')
print(union2_min[['Name','Height(cm)']])
print('\n')
print('Más Alto:')
print(union2_max[['Name','Height(cm)']])

Menos Alto:
                 Name  Height(cm)
13236      J. McNulty         0.0
13237      J. Barrera         0.0
13238        J. Stead         0.0
13239     A. Semprini         0.0
13240      R. Bingham         0.0
13241    K. Dankowski         0.0
13242       I. Colman         0.0
13243       M. Feeney         0.0
13244        R. Minor         0.0
13245          Klauss         0.0
13246      I. Sissoko         0.0
13247         F. Hart         0.0
13248   L. McCullough         0.0
13249       Li Yunqiu         0.0
13250       F. Garcia         0.0
13251    R. Haemhouts         0.0
13252       E. Binaku         0.0
13253       G. Miller         0.0
13254      A. Aidonis         0.0
13255        L. Sowah         0.0
13256       R. Deacon         0.0
13257   Jang Hyun Soo         0.0
13258     A. Al Malki         0.0
13259     E. Guerrero         0.0
13260         Hernáiz         0.0
13261   H. Al Mansour         0.0
13262         H. Paul         0.0
13263        S. Bauer         0.0
13264      M. Chergui         0.0
13265      D. Gardner         0.0
13266    L. Bengtsson         0.0
13267    F. Jaramillo         0.0
13268      L. Gargu?a         0.0
13269       S. Rivera         0.0
13270        Vinicius         0.0
13271    F. Sepúlveda         0.0
13272       L. Spence         0.0
13273      B. Lepistu         0.0
13274     A. Abruscia         0.0
13275     E. González         0.0
13276      M. Al Amri         0.0
13277    J. Rebolledo         0.0
13278      C. Mamengi         0.0
13279    P. Mazzocchi         0.0
13280       Y. Ammour         0.0
13281  Jwa Joon Hyeop         0.0
13282      O. Marrufo         0.0
13283     Han Pengfei         0.0


Más Alto:
            Name  Height(cm)
11614    T. Holý      205.74
17927  D. Hodzic      205.74

In [31]:
#3
filtro1 = union2['Age']==union2['Age'].min()
filtro2 = union2['Age']==union2['Age'].max()
union2_min = union2[filtro1]
union2_max = union2[filtro2]
print('Menos Viejo:')
print(union2_min[['Name','Age']])
print('\n')
print('Más Viejo:')
print(union2_max[['Name','Age']])

Menos Viejo:
                  Name  Age
11457      W. Geubbels   16
11732         A. Taoui   16
12496   Pelayo Morilla   16
12828         Guerrero   16
13293      H. Massengo   16
13567   Y. Verschaeren   16
15363        Y. Roemer   16
15746      Y. Begraoui   16
15793         J. Lahne   16
16081      J. Italiano   16
16254        S. Steijn   16
16418      J. Kitolano   16
16544       D. Adshead   16
16927        B. Nygren   16
17091         A. Do?an   16
17115       C. Bassett   16
17175         B. Mumba   16
17177         R. Gómez   16
17200     H. Andersson   16
17263  P. Samiec-Talar   16
17354      L. D'Arrigo   16
17712         K. Broda   16
17743        J. Olstad   16
17751         E. Ceide   16
17753         B. Waine   16
17757         L. Smyth   16
17776   M. Köstenbauer   16
17808     A. Mahlonoko   16
17841   F. Tauchhammer   16
17881         R. Hauge   16
17887         M. Tilio   16
17921       J. Rowland   16
17976        M. Larsen   16
18003     J. Imbrechts   16
18018      B. O'Gorman   16
18044          K. Lara   16
18106        J. Cleary   16
18124     G. Hollywood   16
18162     T. Gundelund   16
18166         N. Ayéva   16
18204        B. Worman   16
18206        G. Nugent   16


Más Viejo:
          Name  Age
4741  O. Pérez   45

In [40]:
#5
pd.pivot_table(data=union2[['Nationality','Name']], index='Nationality', aggfunc='count')

                Name
Significado
Defensa         5788
Delantero       2667
Lateral          459
Medio Campista  7208
Portero         2025

In [41]:
#6
pd.pivot_table(data=union2[['Age','Name']], index='Age', aggfunc='count')

     Name
Age
16     42
17    289
18    732
19   1024
20   1240
21   1423
22   1340
23   1332
24   1358
25   1319
26   1387
27   1162
28   1101
29    959
30    917
31    707
32    574
33    408
34    404
35    196
36    127
37     82
38     37
39     25
40     13
41      5
42      1
44      2
45      1

In [42]:
#7
pd.pivot_table(data=union2[['Significado','Name']], index='Significado', aggfunc='count')

                Name
Significado
Defensa         5788
Delantero       2667
Lateral          459
Medio Campista  7208
Portero         2025

8. Cual es el promedio de altura, peso por país
9. Cual es el promedio de altura, peso por equipo
10. Cual es el equipo mas caro egún el salario (wage)
11. Cual es el equipo mas economico según el salario (wage)
12. Cual es la distribución de jugadores por pie preferido?
13. Cual es la relacion entre el país de origen y la posición?
14. Cual es numero de camiseta mas y menos usado?
15. Cual es el equipo que mas cede jugadores a otros equipos?
16. Cual es el equipo que menos cede jugadores a otros equipos?
17. Cual es el equipo que mas recibe jugadores de otros equipos?
18. Cual es el promedio de salario (wage) por posicion (significado)?
19. Cual es el equipo con mas valor en el mercado (Value)?
20. Cual es el equipo con menos valor en el mercado (Value)?
21. Top 7 de jugadores de clausulas de permanencia, muestre al equipo al que pertenece. (Release Clause(Eur))

In [44]:
#8
pd.pivot_table(data=union2[['Nationality','Height(cm)','Weight(kg)']], index='Nationality',values=['Height(cm)','Weight(kg)'], aggfunc=np.mean)

             Height(cm)  Weight(kg)
Nationality
Afghanistan  174.625000   67.698606
Albania      176.847500   74.563546
Algeria      181.271333   75.863262
Andorra      182.880000   78.925008
Angola       179.154667   75.538188
...                 ...         ...
Uzbekistan   181.610000   74.389088
Venezuela    176.965970   74.684610
Wales        181.678915   75.479115
Zambia       180.057778   73.481904
Zimbabwe     178.386154   74.389088

[164 rows x 2 columns]

In [45]:
#9
pd.pivot_table(data=union2[['Club','Height(cm)','Weight(kg)']], index='Club',values=['Height(cm)','Weight(kg)'], aggfunc=np.mean)

                       Height(cm)  Weight(kg)
Club
 SSV Jahn Regensburg   185.332414   79.018855
1. FC Heidenheim 1846  184.240714   79.508198
1. FC Kaiserslautern   183.759231   78.907562
1. FC Köln             184.422143   78.244620
1. FC Magdeburg        185.126923   79.587950
...                           ...         ...
Zag??bie Lubin         181.939259   75.447469
Zag??bie Sosnowiec     181.051200   75.550284
Çaykur Rizespor        181.694667   76.566330
Örebro SK              181.845185   75.447469
Östersunds FK          181.263636   75.502450

[651 rows x 2 columns]

In [57]:
#10
base_fil=pd.pivot_table(data=union2[['Club','Wage(Eur)']], index='Club',values=['Wage(Eur)'], aggfunc=np.sum)
base_fil.sort_values(by='Wage(Eur)', ascending=False, inplace=True)
base_fil.head(1)

             Wage(Eur)
Club
Real Madrid    5017000

In [56]:
#11
base_fil=pd.pivot_table(data=union2[['Club','Wage(Eur)']], index='Club',values=['Wage(Eur)'], aggfunc=np.sum)
base_fil.sort_values(by='Wage(Eur)', ascending=True, inplace=True)
base_fil.head(1)

             Wage(Eur)
Club
Limerick FC      19000

In [58]:
#12
pd.pivot_table(data=union2[['Preferred Foot','Name']], index='Preferred Foot',values=['Name'], aggfunc='count')

                 Name
Preferred Foot
Left             4211
Right           13948

In [60]:
#13
pd.pivot_table(data=union2[['Nationality','Significado','Name']], index='Nationality', columns='Significado',values=['Name'], aggfunc='count')

               Name
Significado Defensa Delantero Lateral Medio Campista Portero
Nationality
Afghanistan     1.0       NaN     NaN            3.0     NaN
Albania        10.0       5.0     1.0           21.0     2.0
Algeria        15.0       8.0     3.0           29.0     5.0
Andorra         1.0       NaN     NaN            NaN     NaN
Angola          4.0       4.0     2.0            5.0     NaN
...             ...       ...     ...            ...     ...
Uzbekistan      NaN       NaN     NaN            2.0     NaN
Venezuela      19.0      15.0     2.0           26.0     4.0
Wales          56.0      17.0     2.0           40.0    14.0
Zambia          1.0       4.0     NaN            4.0     NaN
Zimbabwe        5.0       5.0     1.0            2.0     NaN

[164 rows x 5 columns]

In [62]:
#14
base_fil=pd.pivot_table(data=union2[['Jersey Number','Name']], index='Jersey Number',values=['Name'], aggfunc='count')
base_fil.sort_values(by='Name', ascending=True, inplace=True)
print('Menos Usada:')
print(base_fil.head(1))
print('\n')
print('Más Usada:')
print(base_fil.tail(1))

Menos Usada:
               Name
Jersey Number
85.0              1


Más Usada:
               Name
Jersey Number
8.0             612

In [ ]:
#15
base_fil=pd.pivot_table(data=union2[['Jersey Number','Name']], index='Jersey Number',values=['Name'], aggfunc='count')
base_fil.sort_values(by='Name', ascending=False, inplace=True)
print('Menos Usada:')
print(base_fil.head(1))
print('\n')
print('Más Usada:')
print(base_fil.tail(1))